; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-98)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c3)
    (capacity v3 c3)
    (capacity v4 c3)
    (capacity v5 c3)
    (capacity v6 c3)
    (capacity v7 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l1)
    (at p2 l11)
    (at p3 l9)
    (at p4 l12)
    (at p5 l5)
    (at p6 l9)
    (at p7 l8)
    (at p8 l10)
    (at p9 l16)
    (at p10 l5)
    (at p11 l11)
    (at p12 l1)
    (at p13 l6)
    (at p14 l11)
    (at p15 l12)
    (at p16 l3)
    (at p17 l4)
    (at v1 l9)
    (at v2 l1)
    (at v3 l1)
    (at v4 l15)
    (at v5 l10)
    (at v6 l2)
    (at v7 l8)
    (road l12 l10)
    (road l5 l4)
    (road l14 l16)
    (road l8 l3)
    (road l8 l6)
    (road l8 l12)
    (road l10 l12)
    (road l1 l9)
    (road l16 l7)
    (road l6 l11)
    (road l6 l8)
    (road l7 l16)
    (road l4 l5)
    (road l4 l8)
    (road l9 l1)
    (road l8 l14)
    (road l13 l1)
    (road l2 l7)
    (road l12 l8)
    (road l14 l8)
    (road l3 l8)
    (road l8 l4)
    (road l9 l6)
    (road l9 l15)
    (road l11 l6)
    (road l1 l13)
    (road l7 l2)
    (road l15 l9)
    (road l16 l14)
    (road l6 l9)
    (road l6 l16)
    (road l16 l6)
    (road l1 l4)
    (road l4 l1)
    (road l14 l15)
    (road l15 l14)
    (road l6 l12)
    (road l12 l6)
    (road l2 l12)
    (road l12 l2)
    (road l2 l11)
    (road l11 l2)
    (road l5 l12)
    (road l12 l5)
    (road l8 l10)
    (road l10 l8)
    (road l4 l16)
    (road l16 l4)
    (road l2 l15)
    (road l15 l2)
    (road l3 l16)
    (road l16 l3)
    (road l10 l13)
    (road l13 l10)
    (road l10 l16)
    (road l16 l10)
    (road l2 l6)
    (road l6 l2)
    (road l3 l11)
    (road l11 l3)
    (road l2 l10)
    (road l10 l2)
    (road l8 l16)
    (road l16 l8)
    (road l1 l6)
    (road l6 l1)
    (road l5 l7)
    (road l7 l5)
    (road l6 l13)
    (road l13 l6)
    (road l8 l9)
    (road l9 l8)
    (road l1 l3)
    (road l3 l1)
    (road l5 l14)
    (road l14 l5)
    (road l1 l14)
    (road l14 l1)
    (road l12 l15)
    (road l15 l12)
    (road l2 l5)
    (road l5 l2)
    )
 (:goal (and 
(at p1 l2)
(at p2 l1)
(at p3 l13)
(at p4 l7)
(at p5 l4)
(at p6 l2)
))
)

; plan
1. (drive v6 l2 l11)
   deleted: (at v6 l2)
   added: (at v6 l11)
   goals met: 0 of 6
2. (pick-up v6 l11 p2 c2 c3)
   deleted: (at p2 l11) (capacity v6 c3)
   added: (in p2 v6) (capacity v6 c2)
   goals met: 0 of 6
3. (drive v6 l11 l6)
   deleted: (at v6 l11)
   added: (at v6 l6)
   goals met: 0 of 6
4. (drive v6 l6 l9)
   deleted: (at v6 l6)
   added: (at v6 l9)
   goals met: 0 of 6
5. (pick-up v6 l9 p6 c1 c2)
   deleted: (at p6 l9) (capacity v6 c2)
   added: (in p6 v6) (capacity v6 c1)
   goals met: 0 of 6
6. (pick-up v6 l9 p3 c0 c1)
   deleted: (at p3 l9) (capacity v6 c1)
   added: (in p3 v6) (capacity v6 c0)
   goals met: 0 of 6
7. (drive v6 l9 l1)
   deleted: (at v6 l9)
   added: (at v6 l1)
   goals met: 0 of 6
8. (drop v6 l1 p2 c0 c1)
   deleted: (in p2 v6) (capacity v6 c0)
   added: (at p2 l1) (capacity v6 c1)
   goals met: 1 of 6
9. (pick-up v6 l1 p1 c0 c1)
   deleted: (at p1 l1) (capacity v6 c1)
   added: (in p1 v6) (capacity v6 c0)
   goals met: 1 of 6
10. (drive v6 l1 l13)
   deleted: (at v6 l1)
   added: (at v6 l13)
   goals met: 1 of 6
11. (drop v6 l13 p3 c0 c1)
   deleted: (in p3 v6) (capacity v6 c0)
   added: (at p3 l13) (capacity v6 c1)
   goals met: 2 of 6
12. (drive v6 l13 l10)
   deleted: (at v6 l13)
   added: (at v6 l10)
   goals met: 2 of 6
13. (drive v6 l10 l12)
   deleted: (at v6 l10)
   added: (at v6 l12)
   goals met: 2 of 6
14. (pick-up v6 l12 p4 c0 c1)
   deleted: (at p4 l12) (capacity v6 c1)
   added: (in p4 v6) (capacity v6 c0)
   goals met: 2 of 6
15. (drive v6 l12 l2)
   deleted: (at v6 l12)
   added: (at v6 l2)
   goals met: 2 of 6
16. (drop v6 l2 p1 c0 c1)
   deleted: (in p1 v6) (capacity v6 c0)
   added: (at p1 l2) (capacity v6 c1)
   goals met: 3 of 6
17. (drop v6 l2 p6 c1 c2)
   deleted: (in p6 v6) (capacity v6 c1)
   added: (at p6 l2) (capacity v6 c2)
   goals met: 4 of 6
18. (drive v6 l2 l7)
   deleted: (at v6 l2)
   added: (at v6 l7)
   goals met: 4 of 6
19. (drop v6 l7 p4 c2 c3)
   deleted: (in p4 v6) (capacity v6 c2)
   added: (at p4 l7) (capacity v6 c3)
   goals met: 5 of 6
20. (drive v6 l7 l5)
   deleted: (at v6 l7)
   added: (at v6 l5)
   goals met: 5 of 6
21. (pick-up v6 l5 p5 c2 c3)
   deleted: (at p5 l5) (capacity v6 c3)
   added: (in p5 v6) (capacity v6 c2)
   goals met: 5 of 6
22. (drive v6 l5 l4)
   deleted: (at v6 l5)
   added: (at v6 l4)
   goals met: 5 of 6
23. (drop v6 l4 p5 c2 c3)
   deleted: (in p5 v6) (capacity v6 c2)
   added: (at p5 l4) (capacity v6 c3)
   goals met: 6 of 6
